20250707091506-lesson_1_introducing_safe.org
:PROPERTIES:
:ID:       f7c0e6ae-00cd-4997-bc2a-498e2a8b6c8e
:END:
#+title: Lesson 1 Introducing SAFe
#+filetags: :SAFe

* 1.1
** Agile Product Delivery
- Customer Centricity & Design thinking
- Decouple release value from development cadence
- Continously explore, integrate, deploy and release

** Team and Technical Agility
- High performing, cross-functional agile teams
- Teams of business and technical teams build solutions
- Quality business solutions delight customers

* 1.3 Lean-Agile Mindeset and SAFe core Values
** Lean thinking Principles
** Precisely specify value by product
** Identify value stream for each product
** make value flow without interruptions
** Let customer pull value from producer
** Pursue perfection

- [[id:749eaa0b-fc40-48f8-bbad-ca33f1c2d332][Agile Values]]
- [[id:8bab3055-360b-4ff5-9811-a07a5a57d50d][SAFe Core Values]]

* 1.4 SAFe Lean-Agile Principles
1. Take an economic view
2. Apply systems thinking
3. Assume variability; preserve options
4. Build incrementally with fast, integreated learning cycles
5. Base milestones on objective evaluation of working systems
6. Make value flow without interruptions
7. Apply cadence, synchronize with cross-domain planning
8. Unlock intrinsic motivation of knowledge workers
9. Decentralize decision-making
10. Organize around value

* Review
Recognized SAFe as an operating system for Business Agility
Summarized Team and Technical Agility and Agile Product Delivery Competencies
Described the Lean-Agile Mindset and SAFe Core Values
Identified SAFe Lean-Agile principles
