20250707091506-lesson_1_introducing_safe.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 09:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lesson 1 Introducing SAFe</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lesson 1 Introducing SAFe</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org077fa3f">1. 1.1</a>
<ul>
<li><a href="#orgbc04ee8">1.1. Agile Product Delivery</a></li>
<li><a href="#orgd32e23f">1.2. Team and Technical Agility</a></li>
</ul>
</li>
<li><a href="#orgd1fb8f6">2. 1.3 Lean-Agile Mindeset and SAFe core Values</a>
<ul>
<li><a href="#orgb2c6cfe">2.1. Lean thinking Principles</a></li>
<li><a href="#org067c7de">2.2. Precisely specify value by product</a></li>
<li><a href="#org409a857">2.3. Identify value stream for each product</a></li>
<li><a href="#org105c88d">2.4. make value flow without interruptions</a></li>
<li><a href="#orgf96a01b">2.5. Let customer pull value from producer</a></li>
<li><a href="#orgb255dbd">2.6. Pursue perfection</a></li>
</ul>
</li>
<li><a href="#org6dd3545">3. 1.4 SAFe Lean-Agile Principles</a></li>
<li><a href="#org9594197">4. Review</a></li>
</ul>
</div>
</div>

<div id="outline-container-org077fa3f" class="outline-2">
<h2 id="org077fa3f"><span class="section-number-2">1.</span> 1.1</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgbc04ee8" class="outline-3">
<h3 id="orgbc04ee8"><span class="section-number-3">1.1.</span> Agile Product Delivery</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Customer Centricity &amp; Design thinking</li>
<li>Decouple release value from development cadence</li>
<li>Continously explore, integrate, deploy and release</li>
</ul>
</div>
</div>

<div id="outline-container-orgd32e23f" class="outline-3">
<h3 id="orgd32e23f"><span class="section-number-3">1.2.</span> Team and Technical Agility</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>High performing, cross-functional agile teams</li>
<li>Teams of business and technical teams build solutions</li>
<li>Quality business solutions delight customers</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd1fb8f6" class="outline-2">
<h2 id="orgd1fb8f6"><span class="section-number-2">2.</span> 1.3 Lean-Agile Mindeset and SAFe core Values</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb2c6cfe" class="outline-3">
<h3 id="orgb2c6cfe"><span class="section-number-3">2.1.</span> Lean thinking Principles</h3>
</div>
<div id="outline-container-org067c7de" class="outline-3">
<h3 id="org067c7de"><span class="section-number-3">2.2.</span> Precisely specify value by product</h3>
</div>
<div id="outline-container-org409a857" class="outline-3">
<h3 id="org409a857"><span class="section-number-3">2.3.</span> Identify value stream for each product</h3>
</div>
<div id="outline-container-org105c88d" class="outline-3">
<h3 id="org105c88d"><span class="section-number-3">2.4.</span> make value flow without interruptions</h3>
</div>
<div id="outline-container-orgf96a01b" class="outline-3">
<h3 id="orgf96a01b"><span class="section-number-3">2.5.</span> Let customer pull value from producer</h3>
</div>
<div id="outline-container-orgb255dbd" class="outline-3">
<h3 id="orgb255dbd"><span class="section-number-3">2.6.</span> Pursue perfection</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li><a href="20250707094404-agile_values.html#ID-749eaa0b-fc40-48f8-bbad-ca33f1c2d332">Agile Values</a></li>
<li><a href="20250707095402-safe_core_values.html#ID-8bab3055-360b-4ff5-9811-a07a5a57d50d">SAFe Core Values</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6dd3545" class="outline-2">
<h2 id="org6dd3545"><span class="section-number-2">3.</span> 1.4 SAFe Lean-Agile Principles</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Take an economic view</li>
<li>Apply systems thinking</li>
<li>Assume variability; preserve options</li>
<li>Build incrementally with fast, integreated learning cycles</li>
<li>Base milestones on objective evaluation of working systems</li>
<li>Make value flow without interruptions</li>
<li>Apply cadence, synchronize with cross-domain planning</li>
<li>Unlock intrinsic motivation of knowledge workers</li>
<li>Decentralize decision-making</li>
<li>Organize around value</li>
</ol>
</div>
</div>

<div id="outline-container-org9594197" class="outline-2">
<h2 id="org9594197"><span class="section-number-2">4.</span> Review</h2>
<div class="outline-text-2" id="text-4">
<p>
Recognized SAFe as an operating system for Business Agility
Summarized Team and Technical Agility and Agile Product Delivery Competencies
Described the Lean-Agile Mindset and SAFe Core Values
Identified SAFe Lean-Agile principles
</p>
</div>
</div>
</div>
</body>
</html>
